# 성능 데이터 모델링
: 데이터베이스 성능 항상을 목정으로 설계단계의 데이터 모델링 때부터 성능과 관련된 사항이 데이터 모델링에 반영될 수 있도록 하는 것이다.

- 데이터의 증가가 빠를수록 성능저하에 따른 성능개선비용은 증가한다.
- 데이터모델은 성능을 튜닝하면서 변경이 될 수 있는 특징이 있다.
- 분석/ 설계 단계에서 성능을 고려한 데이터모델링을 수행할 경우 성능 저하에 따른 Rework 비용을 최소화 할 수 있는 기회를 가지게 된다. 

 **어떤 중요 트랜잭션이 성능이 저하되면 안되는 특징을 가지고 있다면.**
1. 프로젝트 초기에 운영환경에 대비한 테스트 환경을 구현한다.
2. 그곳에 트랜잭션을 발생시켜 실제 성능을 테스트한다.
3. 모델의 구도를 변경하면서 어떠한 구조가 해당 사이트에 성능상 적절한 구조인지 검토한다. 

## 성능 데이터 모델링 수행 절차 
 1. 데이터모델링을 할 때 정규화를 정확하게 수행한다.
2. 데이터베이스 용량산정을 수행한다.
3. 데이터베이스에 발생되는 트랜잭션의 유형을 파악한다.
4. 용량과 트랜잭션의 유형에 따라 반정규화를 수행한다.
5. 이력모델의 조정, PK/FK조정, 슈퍼타입/서브타입 조정등을 수행한다. 

**->  정규화가 항상 조회성능을 저하시킨다는 것은 잘못된 생각이며 기본적으로 중복된 데이터를 제거함으로써 조회성을 향상시킬 수 있어야 한다. **



# 정규화 
 ## 정규화 란
 > 데이터베이스 설계에서 중복요소를 찾아 제거하고 데이터 구조화 하는 프로세스, 데이터가 꼬이는 것을 막기위해 테이블을 잘게 나누는것. 
 
 ## 정규화 
 **제 1 정규화 (원자성)**
 : 모든 속성은 반드시 하나의 값만 가져야 한다. 
 
 **제 2 정규화 (부분 종속)**
 : 모든 속성은 반드시 기본케어 종속되어야 한다.
 
 **제 3 정규화 (이행종속)**
 : 기본키가 아닌 모든 속성간에는 서로 종속될 수 없다. 
 
 **BCNF 정규화 **
 : 릴레이션의 모든 결정자가 후보키인 릴레이션 
 
 
 ## 정규화를 통한 성능향상 전략
 - 데이터에 대한 중복성을 제거하여준다.
 - 일반적으로 정규화가 잘되어 있으면 입력/수정/삭제의 성능이 향상되고 반정규화를 많이하면 조회의 성능이 향상된다.
 - 중복속성에 대한 분리가 1차 정규화의 정의임
 (로우단위의 대상, 칼럼 단위로 중복도 해당)
 
 
 # 반정규화 
 : 데이터를 중복하여 성능을 향상시키기 위한 기법, 성능을 향상시키기 위해 정규화된 데이터 모델에서 중복, 통합, 분리 등을 수행하는 모든 과정을 의미한다.
 
 -> **데이터 무결성** 위험을 무릅쓰고 데이터를 중복하여 반정규화를 적용하는 이유 
  : 데이터를 조회할때 디스크 I/O량이 많아서 성능이 저하되거나 경로가 너무 멀어 조인으로 인한 성능 저하가 예상되거나 칼럼을 계산하여 읽을때 성능이 저하될 것이 예상되는 경우 반정규화를 수행하게 된다. 
  
  
  ## 테이블, 칼럼 반정규화
  
  ![](https://images.velog.io/images/yuhayung7296/post/0cd1969e-b5c8-43f0-8919-f052c7084e29/image.png)
  
  
  ![](https://images.velog.io/images/yuhayung7296/post/a8d7b606-add1-4eae-a539-65438e27078e/image.png)
  

## 반정규화 절차 

![](https://images.velog.io/images/yuhayung7296/post/f5da72dc-82f0-4409-8f33-4c59e3166cfe/image.png)


## 반정규화 대상 다른 처리 방법 

- 지나치게 많은 조인이 걸려 데이터를 조회하는 작업이 기술적으로 어려울 경우 
 :** 뷰(VIEW)를 사용하면 이를 해결할 수 있다. **
 
- 대량의 데이터커리나 부분처리에 의해 성능이 저하되는 경우
: **클러스터링을 적용하거나 인덱스를 조정**함로써 성능을 향상 시킬 수 있다. 
- 대량의 데이터는 Primary Key의 성격에 따라 부분적인 테이블로 분리 될 수 있다. 
 :** 파티셔닝(Partitioning)기법** 으로 성능저하를 방지할 수 있다. 
- 응용 애플리케이션에서 로직을 구사하는 방법을 변경함으로써 성능을 향상시킬 수 있다. 
 

# 수퍼/서브 타입
슈퍼/ 서브 타입 데이터 모델의 변환 기술 

- 개별로 발생되는 트랜잭션에 대해서는 개별 테이블로 구성
- 슈퍼타입 + 서브타입에 대해 발생되는 트랜잭션에 대해서는 슈퍼타입 + 서브타입 테이블로 구성 
- 전체를 하나로 묶어 트랜잭션이 발생할 때는 하나의 테이블로 구성 

> 트랜잭션은 항상 전체를 통합하여 분석 처리하는데 슈퍼- 서브타입이 하나의 테이블로 통합되어 있으면 하나의 테이블에 데이터만 읽어 처리 할 수 있기 때문에 다른 형식에 비해 더 성능이 우수하다. 

# 트랜잭션의 특징 
- **원자성** : 트랜잭션의 작업은 모두 수행되거나 모두 수행되지 않아아야 한다. 
- **일관성** : 트랜잭션이 완료되면 데이터 무결성이 일관되게 보장되어야 함
- **고립성**: 트랜잭션이 다른 트랜잭션으로 부터 고립된 상태로 수행되어야 함
- **지속성** : 트랜잭션이 완료되면 장애나 발생하더라도 변경 내용이 지속되어야 함


[트랜잭션의 대한 자세한 블로그 📌](http://www.jidum.com/jidums/view.do?jidumId=193)

# PK 순서
- PK순서 결정하는 기준은 인덱스 정렬구조를 이해한 상태에서 인텍스를 효율적으로 이용할 수 있도록 PK를 지정해야 한다. 

인덱스의 특징은 여러개의 속성이 하나의 인덱스로 구성되어 있을 때 앞쪽에 위치한 속성의 값이 비교자로 있어야 인덱스가 좋은 효율을 나타낼 수 있다. 앞쪽에 위치한 속성 값이 가급적 '=' 아니면 최고한 범위 'BETWEEN'. '<>'가 들어와야 인덱스를 이용할 수 있는 것이다. 


# 분산 데이터
## 장단점 
** 장점 **
 - 지역 자치성, 점증적 시스템 용량 확장 
 - 신뢰성과 가용성
 - 효용성과 융통성
 - 빠른 응답 속도와 통신비용 절감 
 - 데이터의 가용성과 신뢰성 증가 
 - 시스템 규모의 적절한 조절
 - 각 지역 사용자의 욕구 수용 증대
 
** 단점 **
 - 소프트웨어 개발 비용
 - 오류의 잠재성 증대
 - 처리비용의 증대
 - 설계, 관리의 복잡성과 비용
 - 불규칙한 응답속도 
 - 통제의 어려움 
 - 데이터 무결성에 대한 위협 
 
 

---

SQLD 합격 가즈아 ~~~!!! 🔥🔥🔥🔥🔥
 
